{"data":{"markdownRemark":{"html":"<p>As per Wikipedia, Design thinking is the cognitive process from which design concepts (e.g. ideas for products) emerge. Design thinking is related to, but is different from problem-solving, decision-making, creativity, sketching and prototyping. During design thinking, the designer's attention oscillates between their understanding of a problem context and their ideas for a solution. New solution ideas lead to a deeper understanding of the problematic context, which in turn triggers more solution ideas.</p>\n<p>When your focus acts like a pendulum between problem context and the creative solution then you are bound to wear multiple hats. The irony as the developer when designing API is that your clients are other developers.\nOver the past decade after working under some fine mentors the summary of the learning can be stated as “Think of developing API endpoints for a command line interface, possibly it will result in self-understandable, complete solution you are seeking”.</p>\n<p>This post is inspired by eBook published by APIgee highlighting the best practiced for REST design. As an API designer, I have gone through some challenges myself, viz.</p>\n<p><strong>What should be my base URL?</strong></p>\n<p>Keep it short and simple. Try to use nouns and keep verbs out of your base URL. To smartly cover all possible scenario use HTTP verb standard.\nEg.</p>\n<table>\n<thead>\n<tr>\n<th>Resource</th>\n<th align=\"center\">POST</th>\n<th align=\"center\">GET</th>\n<th align=\"center\">PUT</th>\n<th align=\"center\">DELETE</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td></td>\n<td align=\"center\">create</td>\n<td align=\"center\">read</td>\n<td align=\"center\">update</td>\n<td align=\"center\">delete</td>\n</tr>\n<tr>\n<td>/users</td>\n<td align=\"center\">create a new user</td>\n<td align=\"center\">list users</td>\n<td align=\"center\">bulk update users</td>\n<td align=\"center\">delete all users</td>\n</tr>\n<tr>\n<td>/users/1234</td>\n<td align=\"center\">error</td>\n<td align=\"center\">show user</td>\n<td align=\"center\">update if exists or error</td>\n<td align=\"center\">delete user</td>\n</tr>\n</tbody>\n</table>\n<p>The point is that developers probably don't need the chart to understand how the API behaves. They can experiment with and learn the API without the documentation.</p>\n<p><strong>Shall I use plurals or singular nouns?</strong></p>\n<p>The recommended practice is to use plurals since the first API being tested by developers is most probably GET and GET /users to list all users make natural sense. Irrespective whatever you choose, be consistent to avoid confusing your API consumers. Moreover, concrete names are better than abstract ones. Eg. Having an endpoint like /blogs or /videos over abstract names like /items or /contents can help the consumer to identify resources more conveniently.<br>\nYou also want to expose a manageable number of resources. Aim for concrete naming and keep the number of resources between 12 and 24.</p>\n<p><strong>How should the relations and associations be exposed in API?</strong></p>\n<p>Resource always have relationships with other resources. oData standard makes it easier for developers to navigate resource and its association using metadata, it can be also let to exposing your information schema.<br>\nThe recommended practise is to follow ‘resource/identity/resource’ model eg. /users/1234/department. It's not uncommon to see people string these together making a URL 5 or 6 levels deep. Remember that once you have the primary key for one level, you usually don't need to include the levels above because you've already got your specific object.</p>\n<p><strong>How do we handle the complexity of pagination, partial response, filters etc.?</strong></p>\n<p>Make it simple for developers to use the base URL by putting optional states and attributes behind the query string question mark. E.g. GET /users?name=xxx<br>\nFor pagination request for limit and offset eg. GET /users?limit=50&#x26;offset=100 additionally, request fields to make it precise. Avoid using special characters in the query string. A good API always have defaults for pagination.<br>\nGood example /GET users?fields=name,gender<br>\nBad example /Get users:(name,gender)<br>\nWe also suggest including metadata with each response that is paginated that indicated to the developer the total number of records available. Use JSON-LD/HAL/Collection+JSON/SIREN/JSONAPI.ORG specifications as your starting point and don’t forget to be creative.</p>\n<p><strong>What is the recommended practice for error handling?</strong></p>\n<p>The developers learn to write code through error and trial, most important they rely on error messages during critical times for troubleshooting and resolving issues.<br>\nAs the best practice always serve the error messages with correct HTTP status codes, also include a verbose error message with as many details as possible. We highly recommend that you add a link in your description to add more information.<br>\nIn certain circumstances the framework used by developer intercepts the message and follows the default routine, thus developer may have no opportunity to inform his user appropriately. Thus, if you can provide a flag to suppress the status code and result in HTTP - 200 OK with actual status code and the message passed along with the payload.</p>\n<p><strong>Shall we version control the API?</strong></p>\n<p>Never release an API without a version and make the version mandatory. Keep the version naming simple and maintain compatibility with at least one version backwards for minimum 6-12 months.<br>\nSome developers advocate as to keep the version information in headers. But API can have breaking changes, thus being verbose and explicitly specifying version numbers in URL can help developers identify gaps early.</p>\n<p><strong>What about responses that don’t involve resources?</strong></p>\n<p>In certain cases, API calls that sends a response which is not a resource e.g. Calculate, Translate are not uncommon depending on the domain.\nIn these cases, Use verbs not nouns e.g. /convert?from=USD&#x26;to=AUD&#x26;amount=100<br>\nMake it clear in your API documentation that these “non-resource” scenarios are different, maybe in you swagger docs.  </p>\n<p><strong>How many formats shall we support?</strong></p>\n<p>Respect the HTTP header content-type and accepts e.g. Accept: application/json but let the user override using dot notation e.g. GET /user/1234.dat or GET /user/1234.xml<br>\nIf the default form is JSON, in the response properties try using camelCase for attributes as it is easier for the front-end developer to parse into objects with standard JavaScript conventions.</p>\n<p><strong>Any other tips and tricks?</strong></p>\n<p><em>Tip1:</em><br>\nA simple can be verb based resourceful API but for complex scenarios use google model\ne.g.<br>\n/search?q=xxx<br>\n/user?q=xxx<br>\n/location/1234/user=xxx – scoped<br>\n/search.xml?q=xxx – formatted</p>\n<p><em>Tip2:</em><br>\nConsolidate API under a single domain with segregation for environments following a standard pattern e.g.\napi.xxx.com\nuat-api.xxx.com\ndev-api.xxx.com</p>\n<p><em>Tip3:</em><br>\nUse standard known authentication/authorization methodologies e.g. oAuth2.0 etc</p>\n<p><em>Tip4:</em><br>\nTry to complement your API with SDK</p>\n<p><em>Tip5:</em><br>\nUsing POST to emulate PUT, DELETE, PATCH. If your development platform or firewall rules prevent you from calling HTTP methods like PUT, PATCH or DELETE, use the X-HTTP-Method-Override header. Pass the method you want to use in the X-HTTP-Method-Override header and make your call using the POST method</p>\n<p><strong>What API design pattern is an ideal choice in most cases?</strong></p>\n<p>The architect must carefully evaluate available options and what suits the business domain and skill set of available developers in terms of project support and maintainability. But in most cases, an API Façade with mediate to complement can cover the majority of cases. This is covered in detail in another post.</p>","timeToRead":5,"frontmatter":{"date":"October 10, 2018","pathForPage":"2018-10-10-coding-blueprint-for-pragmatic-rest-api-developers","title":"Developers guide to designing REST endpoints"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"pathForPage":"2018-10-10-coding-blueprint-for-pragmatic-rest-api-developers"}}